import styles from "./Policy.module.scss";

function Policy() {
  return (
    <div className={`${styles.container} container`}>
      <h2 className={`${styles.title} text-primary-blue`}>
        Політика конфіденційності
      </h2>
      <p>Останнє оновлення: 24.02.2025</p>
      <p>
        EpicVision прагне забезпечити конфіденційність та захист персональних
        даних наших користувачів. Ця Політика конфіденційності пояснює, які дані
        ми збираємо, як їх використовуємо та захищаємо.
      </p>
      <h3>1. Які дані ми збираємо</h3>
      <p>
        При використанні нашого сайту ми можемо збирати наступні типи даних:
      </p>
      <ul className={styles.list}>
        <li>
          Персональні дані: ім'я, електронна пошта, номер телефону (при
          оформленні бронювання або підписці на новини).
        </li>
        <li>
          Технічні дані: IP-адреса, тип пристрою, браузер, файли cookie та інші
          дані про активність на сайті.
        </li>
      </ul>

      <h3>2. Як ми використовуємо дані</h3>
      <ul className={styles.list}>
        Ми використовуємо ваші дані для таких цілей:
        <li>Обробка замовлень та бронювань квитків.</li>
        <li>Надсилання новин, акцій та спеціальних пропозицій (за згодою).</li>
        <li>Покращення роботи сайту та користувацького досвіду.</li>
        <li>Захист від шахрайства та зловживань.</li>
      </ul>
      <h3>3. Зберігання та захист даних</h3>
      <p>
        Ми застосовуємо сучасні заходи безпеки для захисту ваших персональних
        даних від несанкціонованого доступу, втрати чи розголошення.
      </p>
      <h3>4. Передача даних третім особам</h3>
      <p>
        Ми не передаємо ваші персональні дані третім особам без вашої згоди, за
        винятком випадків, передбачених законодавством.
      </p>
      <h3>5. Ваші права</h3>
      <ul className={styles.list}>
        Ви маєте право:
        <li>Отримати інформацію про збережені дані.</li>
        <li>Вимагати їх змінення або видалення.</li>
        <li>Відкликати згоду на обробку персональних даних.</li>
      </ul>
      <h3>6. Зміни до політики</h3>
      <p>
        Ми можемо періодично оновлювати цю Політику конфіденційності. Актуальна
        версія завжди доступна на сайті.
      </p>
    </div>
  );
}

export default Policy;
